from cv2 import HOGDescriptor


def traffic_sign_hog_descriptor():
    # hog params for traffic signs
    winSize = (24, 24)
    cellSize = (4, 4)
    blockSize = (4, 4)  # (8, 8)
    blockStride = (2, 2)  # (4, 4)
    bins = 24  # 18/36
    derivAperture = 1
    winSigma = -1.
    histogramNormType = 0
    L2HysThreshold = 0.2
    gammaCorrection = 1
    levels = 64
    signedGradients = True  # False

    # init hog descriptor
    return HOGDescriptor(winSize, blockSize, blockStride, cellSize, bins, derivAperture, winSigma,
                         histogramNormType, L2HysThreshold, gammaCorrection, levels, signedGradients)


traffic_signs_classes = {
    0: "Железнодорожный переезд со шлагбаумом",
    1: "Опасный поворот направо",
    2: "Опасный поворот налево",
    3: "Крутой поворот направо",
    4: "Крутой поворот налево",
    5: "Крутой склон",
    6: "Крутой подъем",
    7: "Скользкая дорога",
    8: "Неровная дорога",
    9: "Приближение к искусственной неровности",
    12: "Железнодорожный переезд без шлагбаума",
    13: "Сужение дороги с обеих сторон",
    14: "Сужение дороги справа",
    15: "Сужение дороги слева",
    17: "Приближение к пешеходному переходу",
    18: "Дети",
    19: "Дорожные работы",
    20: "Дикие животные",
    21: "Прочие опасности",
    22: "Пересечение с трамвайной линией",
    23: "Светофорное регулирование",
    29: "Движение без остановки запрещено",
    31: "Движение запрещено",
    36: "Поворот направо запрещен",
    37: "Поворот налево запрещен",
    38: "Разворот запрещен",
    39: "Проезд запрещен",
    40: "Обгон запрещен",
    41: "Ограничение 10 км/ч",
    42: "Ограничение 20 км/ч",
    43: "Ограничение 30 км/ч",
    44: "Ограничение 40 км/ч",
    45: "Ограничение 5 км/ч",
    46: "Ограничение 50 км/ч",
    47: "Ограничение 60 км/ч",
    48: "Ограничение 70 км/ч",
    49: "Ограничение 80 км/ч",
    50: "Остановка запрещена",
    51: "Стоянка запрещена",
    52: "Стоянка запрещена по нечетным дням",
    53: "Стоянка запрещена по четным дням",
    56: "Велосипедная дорожка",
    79: "Пешеходный переход",
    80: "Искусственная неровность",
    106: "Уступите дорогу",
    107: "Отмена всех ограничений",
    108: "Отмена ограничения на обгон",
    110: "Ограничение 100 км/ч",
    111: "Ограничение 120 км/ч"
}

circle_signs_keys = [29, 31, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 56, 68, 80,
                     107, 108, 110, 111]
triang_rect_signs_keys = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 106, 79]
globallySignsList = [110, 111, 41, 42, 43, 44, 45, 46, 47, 48, 49, 40, 21, 18, 19, 20, 7, 8]
locallySignsList = [107, 108, 106, 80, 79, 56, 51, 52, 53, 50, 39, 22, 23, 29, 31, 36, 37, 38, 17, 9, 12, 13, 14, 15, 0,
                    1, 2, 3,
                    4, 5, 6]
ruleLastSignsList = [110, 111, 41, 42, 43, 44, 45, 46, 47, 48, 49]
